Repository: gekoke/abiopetaja
Catalog: app/locale/*/LC_MESSAGES/django.po
Languages: et

source: Number sets
et: Arvuhulgad

source: Expressions
et: Avaldised

source: Exponential and logarithmic functions
et: Eksponent- ja logaritmfunktsioon

source: Functions and sequences
et: Funktsioonid ja arvjadad

source: Trigonometry I and II
et: Trigonomeetrilised I ja II

source: Equations and systems of equations
et: Võrrandid ja võrrandisüsteemid

source: Inequalities and systems of inequalities
et: Võrratused ja võrratusesüsteemid

source: Vectors in the plane and line equations
et: Vektor tasandil ja joone võrrand

source: Trigonometric functions, limits and results
et: Trigonomeetrilised funktsioonid, piirväärtus ja tulemised

source: Applications of the derivative
et: Tuletise rakendused

source: Integral and plane geometry
et: Integraal ja planimeetria

source: Line and plane in space
et: Sirge ja tasand ruumis

source: Solid geometry
et: Stereomeetria

source: Applications of mathematics, study of real-world processes
et: Matemaatika rakendused, reaalse protsessi uurimine

source: Template to generate test from
et: Vali mall, millest dokumente genereerida

source: Number of test versions
et: Variantide arv

source: Name
et: Nimi

source: My Test
et: Minu töö

source: A test with this name already exists
et: Sellise nimega töö on juba olemas

source: Another test with this name already exists
et: Teine sellise nimega töö on juba olemas

source: Inequalities
et: Võrratused

source: Inequalities Test, Spring 2024
et: Kontrolltöö, võrratused - kevad 2024

source: Another template with this name already exists
et: Teine sellise nimega mall on juba olemas

source: Topic cannot be empty
et: Teema ei saa olla tühi

source: Version %(version)s
et: Variant %(version)s

source: Only you can see this name
et: Ainult sina näed seda nime

# of a template
source: Title
et: Pealkiri

source: Anything you add to this field will be rendered at the top of the test document
et: Kõik, mis siia lahtrisse lisad, kuvatakse töölehe ülalosas

source: The topic of the problem (e.g., ARVUHULGAD, AVALDISED, etc.)
et: Teema

source: Lihtne
et: Easy

source: Keskmine
et: Medium

source: Raske
et: Hard

source: The difficulty of the problem
et: Ülesande raskusaste

source: [Unnamed Test]
et: [Nimeta töö]

# of a user feedback
source: Content
et: Sisu

source: Save
et: Salvesta

source: Cancel
et: Tühista

source: Confirm Deletion
et: Kinnita kustutamine

source: Delete Permanently
et: Kustuta jäädavalt

source: Update
et: Uuenda

# view in the application
source: Dashboard
et: Peamenüü

source: Welcome, %(name)s!
et: Tere, %(name)s!

source: New Test ✅️
et: Uus töö ✅

source: Generate a new test
et: Genereeri uus töö

source: Generate!
et: Genereeri!

source: My Templates 📐
et: Minu mallid 📐

source: Collections of problems that can be used to generate tests
et: Ülesannete kogud, mida saab töödeks genereerida

# math tests
source: My Tests 📄
et: Minu tööd 📄

source: Browse all your tests
et: Vaata kõiki oma teste

source: All Topics and Difficulties 🧠
et: Kõik teemad ja raskusastmed 🧠

source: Browse all the available topics
et: Vaata kõiki teemasid

source: <p>Are you sure you want to delete the template <b>%(template_problem)s</b>?</p>
et: <p>Olete kindel, et soovite kustutada malli <b>%(template_problem)s</b>?</p>

source: Create Template
et: Loo mall

source: Dashboard
et: Peamenüü

source: Templates
et: Mallid

source: Add Problem
et: Lisa ülesanne

source: Problem
et: Ülesanne

source: Count
et: Arv

# view in the application
source: Templates
et: Mallid

source: New Template
et: Uus mall

# referring to the count of problems
source: Problems
et: Ülesandeid

source: Created At
et: Loodud

source: Update Template
et: Uuenda malli

source: <p>Are you sure you want to remove the problem <b>%(template_problem)s</b> from the test?</p>
et: <p>Olete kindel, et soovite <b>%(template_problem)s</b> eemaldada tööst?</p>

source: Update Problem
et: Uuenda ülesannet

source: <p>Are you sure you want to delete the test <b>%(test_name)s</b>?</p>
et: <p>Olete kindel, et soovite kustutada töö <b>%(test_name)s</b>?</p>

source: Tests
et: Tööd

source: Update Test
et: Uuenda tööd

source: Delete Test
et: Kustuta töö

source: Version %(test_version_number)s
et: Variant %(test_version_number)s

source: Answer Key
et: Vastuseleht

source: Create a Test from a Template
et: Genereeri test

source: Save Test
et: Salvesta töö

source: Version %(version_number)s
et: Variant %(version_number)s

# view in the application
source: Tests
et: Tööd

source: Generate Test
et: Genereeri töö

# referring to the count of test versions
source: Versions
et: Variante

source: Topics and Difficulties
et: Teemad ja raskusastmed

source: Topics & Difficulties
et: Teemad ja raskusastmed

source: Topic
et: Teema

source: Difficulty
et: Raskusaste

source: Easy
et: Lihtne

source: Medium
et: Keskmine

source: Hard
et: Raske

source: No topics found.
et: Teemasid ei leitud

source: Leave Feedback
et: Jäta tagasisidet

source: This template has no problems and would result in an empty test.
et: Sellel mallil puuduvad ülesanded, mille tõttu genereeriks tühi töö.

source: <div>The test was saved successfully. <a href="%(url)s">Click here</a> to view the test.</div>
et: <div>Töö salvestati edukalt. <a href="%(url)s">Klõpsa siia</a>, et tööd vaadata.

source: The template was created successfully.
et: Mall salvestati edukalt

source: The template was updated successfully.
et: Mall salvestati edukalt

source: The template was deleted successfully.
et: Mall kustutati edukalt

source: The test was updated successfully.
et: Töö salvestati edukalt

source: The problem entry was updated successfully.
et: Ülesanne salvestati edukalt

source: The problem entry was deleted successfully.
et: Ülesanne kustutati edukalt

source: The test was deleted successfully.
et: Töö kustutati edukalt

source: Your feedback was submitted. Thanks!
et: Saime su tagasiside kätte. Tänud!
